In [3]:
import pandas as pd
import numpy as np

In [8]:
ser = pd.Series(np.array(['male','female','male']))
ser

0      male
1    female
2      male
dtype: object

In [12]:
dict_data = {'a': 1, 'b': 2, 'c': 3}
dict_ser = pd.Series(dict_data)
dict_ser.index
dict_ser.values

array([1, 2, 3])

In [24]:
df = pd.DataFrame({"Name": ['Tom', 'Jack', 'Steve', 'Ricky'], "Sex": ["Male", "Female", "Male", "Male"], 'Age': [
    28, 34, 29, 42]})
df

    Name     Sex  Age
0    Tom    Male   28
1   Jack  Female   34
2  Steve    Male   29
3  Ricky    Male   42

In [27]:
df.sort_index()

    Name     Sex  Age
0    Tom    Male   28
1   Jack  Female   34
2  Steve    Male   29
3  Ricky    Male   42

In [31]:
df["Age"].apply(lambda age:age+10) # lambda applies for every element

0    38
1    44
2    39
3    52
Name: Age, dtype: int64